from flask import jsonify, request, g
from . import api
from ..models import Teacher, Parent, TEvaluation, PEvaluation, TScore, PScore, Child, Theclass
from ..kmeans import Kmeans
from .. import db
from .decorators import parent_login_required, login_required, teacher_login_required
import random
from operator import itemgetter

import pprint

@api.route("/chart/", methods = ["GET"])
@parent_login_required
def get_chart():
    try:
        parent = g.current_user
        child = Child.query.filter_by(id=parent.child_id).first() or None
        if child is None:
            return jsonify({
                "msg": "child not found."
            })
        tes = TEvaluation.query.filter_by(child_id=child.id).all()
        pes = PEvaluation.query.filter_by(child_id=child.id).all()
        # 即便没有10个也不会报错
        tes = tes[-10:]
        pes = pes[-10:]

        tes_format_datas = [te.eval_format_data() for te in tes]
        pes_format_datas = [pe.eval_format_data() for pe in pes]
        datas = tes_format_datas + pes_format_datas
        datas = sorted(datas, key=itemgetter('time'))
        print(datas)
        rows = []
        for d in datas:
            hdsp = 0
            zxgl = 0
            qxzk = 0
            zzl = 0
            lmsz = 0
            for s in d.get("scores"):
                if s.get("key") == "活动水平":
                    hdsp = s.get("score")
                elif s.get("key") == "作息规律":
                    zxgl = s.get("score")
                elif s.get("key") == "情绪状况":
                    qxzk = s.get("score")
                elif s.get("key") == "专注力":
                    zzl = s.get("score")
                elif s.get("key") == "礼貌素质":
                    lmsz = s.get("score")
            arow = {
                "日期": d.get("time"),
                "活动水平": hdsp,
                "作息规律": zxgl,
                "情绪状况": qxzk,
                "专注力": zzl,
                "礼貌素质": lmsz
            }
            rows.append(arow)
        return jsonify(rows)
    except Exception as e:
        print(e)
        return chart_test()


@api.route("/chart/test/", methods = ["GET"])
def chart_test():
    chartData = {
            "chartData":
                {
                    "columns": ["日期","活动水平", "作息规律", "情绪状况", "专注力", "礼貌素质"],
                    "rows": [
                        {
                            "日期": "201901011001",
                            "活动水平": "20",
                            "作息规律": "20",
                            "情绪状况": "20",
                            "专注力": "20",
                            "礼貌素质": "20"
                        },
                        {
                            "日期": "201901021001",
                            "活动水平": "13",
                            "作息规律": "15",
                            "情绪状况": "16",
                            "专注力": "17",
                            "礼貌素质": "18"
                        },
                        {
                            "日期": "201901031001",
                            "活动水平": "19",
                            "作息规律": "18",
                            "情绪状况": "17",
                            "专注力": "17",
                            "礼貌素质": "16"
                        },
                        {
                            "日期": "201901041001",
                            "活动水平": "12",
                            "作息规律": "10",
                            "情绪状况": "8",
                            "专注力": "6",
                            "礼貌素质": "5"
                        },
                        {
                            "日期": "201901051001",
                            "活动水平": "14",
                            "作息规律": "15",
                            "情绪状况": "16",
                            "专注力": "13",
                            "礼貌素质": "12"
                        },
                        {
                            "日期": "201901061001",
                            "活动水平": "13",
                            "作息规律": "14",
                            "情绪状况": "18",
                            "专注力": "20",
                            "礼貌素质": "19"
                        },
                ]
            }
    }
    return jsonify(chartData)


def kmeans_helper(arr):
    names = ["赵泽林","钱阳","孙妍菲","李怡萱","周新文","吴家豪","郑雅忆","冯子恒","陈鸿宇", "韩依霖", "杨雅雯", "朱泽轩", "秦硕", "姜文浩", "孟子文", "邱思雨", "马浩杰", "余淑静", "张圣泽", "许亨哈", "陈宇倩", "陈宇晟", "张全婵", "王丙文", "崔正豪", "袁逸欣", "夏宇宸", "魏斓", "尚海伦", "王韬翔", "谷兆宇", "宋寅明", "陈雅琴", "殷一楠", "王振宇", "陈真颖", "刘鹤尧", "赵海洲", "郝恩奇"]
    
    cms = ['日期']
    nas = []
    for i in range(len(arr)):
        while True:
            key = names[random.randint(0, len(names)-1)]
            if key not in cms:
                cms.append(key)
                nas.append(key)
                break

    data = {
        "data": {
            "columns": cms,
            "rows": []
        }        
    }

    for di in range(len(arr[0])):
        d = {
            '日期': di+1,
        }
        for ci in range(len(arr)):
            key = nas[ci]
            value = arr[ci][di]
            d.update({
                key : value
            })

        data["data"]["rows"].append(d)
    return data


@api.route("/chart/kmeans2/", methods = ["GET"])
def chart_fake():
    a = {
    "data_all": {
        "data": {
            "columns": [
                "日期",
                "张全婵",
                "崔正豪",
                "周新文",
                "韩依霖",
                "马浩杰",
                "赵泽林",
                "陈宇晟",
                "余淑静",
                "姜文浩",
                "陈雅琴",
                "尚海伦",
                "冯子恒",
                "邱思雨",
                "谷兆宇",
                "夏宇宸",
                "吴家豪",
                "宋寅明",
                "王丙文",
                "孙妍菲",
                "魏斓"
            ],
            "rows": [
                {
                    "余淑静": 1,
                    "冯子恒": 18,
                    "吴家豪": 1,
                    "周新文": 7,
                    "夏宇宸": 20,
                    "姜文浩": 8,
                    "孙妍菲": 0,
                    "宋寅明": 4,
                    "尚海伦": 20,
                    "崔正豪": 12,
                    "张全婵": 4,
                    "日期": 1,
                    "王丙文": 2,
                    "谷兆宇": 3,
                    "赵泽林": 18,
                    "邱思雨": 17,
                    "陈宇晟": 15,
                    "陈雅琴": 17,
                    "韩依霖": 19,
                    "马浩杰": 20,
                    "魏斓": 11
                },
                {
                    "余淑静": 20,
                    "冯子恒": 18,
                    "吴家豪": 8,
                    "周新文": 19,
                    "夏宇宸": 2,
                    "姜文浩": 12,
                    "孙妍菲": 16,
                    "宋寅明": 14,
                    "尚海伦": 3,
                    "崔正豪": 5,
                    "张全婵": 7,
                    "日期": 2,
                    "王丙文": 2,
                    "谷兆宇": 2,
                    "赵泽林": 16,
                    "邱思雨": 7,
                    "陈宇晟": 15,
                    "陈雅琴": 20,
                    "韩依霖": 11,
                    "马浩杰": 15,
                    "魏斓": 1
                },
                {
                    "余淑静": 1,
                    "冯子恒": 1,
                    "吴家豪": 20,
                    "周新文": 14,
                    "夏宇宸": 2,
                    "姜文浩": 15,
                    "孙妍菲": 18,
                    "宋寅明": 18,
                    "尚海伦": 12,
                    "崔正豪": 4,
                    "张全婵": 10,
                    "日期": 3,
                    "王丙文": 9,
                    "谷兆宇": 12,
                    "赵泽林": 17,
                    "邱思雨": 3,
                    "陈宇晟": 13,
                    "陈雅琴": 13,
                    "韩依霖": 10,
                    "马浩杰": 8,
                    "魏斓": 7
                },
                {
                    "余淑静": 17,
                    "冯子恒": 19,
                    "吴家豪": 19,
                    "周新文": 17,
                    "夏宇宸": 13,
                    "姜文浩": 8,
                    "孙妍菲": 20,
                    "宋寅明": 9,
                    "尚海伦": 9,
                    "崔正豪": 14,
                    "张全婵": 3,
                    "日期": 4,
                    "王丙文": 3,
                    "谷兆宇": 8,
                    "赵泽林": 6,
                    "邱思雨": 5,
                    "陈宇晟": 19,
                    "陈雅琴": 9,
                    "韩依霖": 0,
                    "马浩杰": 3,
                    "魏斓": 17
                },
                {
                    "余淑静": 4,
                    "冯子恒": 4,
                    "吴家豪": 4,
                    "周新文": 11,
                    "夏宇宸": 4,
                    "姜文浩": 5,
                    "孙妍菲": 16,
                    "宋寅明": 19,
                    "尚海伦": 14,
                    "崔正豪": 7,
                    "张全婵": 6,
                    "日期": 5,
                    "王丙文": 19,
                    "谷兆宇": 8,
                    "赵泽林": 0,
                    "邱思雨": 7,
                    "陈宇晟": 11,
                    "陈雅琴": 11,
                    "韩依霖": 17,
                    "马浩杰": 12,
                    "魏斓": 17
                },
                {
                    "余淑静": 3,
                    "冯子恒": 13,
                    "吴家豪": 8,
                    "周新文": 15,
                    "夏宇宸": 20,
                    "姜文浩": 18,
                    "孙妍菲": 14,
                    "宋寅明": 19,
                    "尚海伦": 18,
                    "崔正豪": 10,
                    "张全婵": 4,
                    "日期": 6,
                    "王丙文": 18,
                    "谷兆宇": 5,
                    "赵泽林": 9,
                    "邱思雨": 20,
                    "陈宇晟": 7,
                    "陈雅琴": 0,
                    "韩依霖": 2,
                    "马浩杰": 1,
                    "魏斓": 11
                },
                {
                    "余淑静": 13,
                    "冯子恒": 6,
                    "吴家豪": 3,
                    "周新文": 19,
                    "夏宇宸": 0,
                    "姜文浩": 19,
                    "孙妍菲": 8,
                    "宋寅明": 1,
                    "尚海伦": 17,
                    "崔正豪": 16,
                    "张全婵": 10,
                    "日期": 7,
                    "王丙文": 1,
                    "谷兆宇": 7,
                    "赵泽林": 9,
                    "邱思雨": 1,
                    "陈宇晟": 20,
                    "陈雅琴": 16,
                    "韩依霖": 14,
                    "马浩杰": 12,
                    "魏斓": 10
                },
                {
                    "余淑静": 4,
                    "冯子恒": 19,
                    "吴家豪": 0,
                    "周新文": 6,
                    "夏宇宸": 4,
                    "姜文浩": 1,
                    "孙妍菲": 20,
                    "宋寅明": 18,
                    "尚海伦": 7,
                    "崔正豪": 2,
                    "张全婵": 20,
                    "日期": 8,
                    "王丙文": 16,
                    "谷兆宇": 8,
                    "赵泽林": 11,
                    "邱思雨": 16,
                    "陈宇晟": 8,
                    "陈雅琴": 8,
                    "韩依霖": 15,
                    "马浩杰": 6,
                    "魏斓": 14
                },
                {
                    "余淑静": 2,
                    "冯子恒": 4,
                    "吴家豪": 0,
                    "周新文": 8,
                    "夏宇宸": 14,
                    "姜文浩": 13,
                    "孙妍菲": 5,
                    "宋寅明": 20,
                    "尚海伦": 5,
                    "崔正豪": 9,
                    "张全婵": 11,
                    "日期": 9,
                    "王丙文": 9,
                    "谷兆宇": 20,
                    "赵泽林": 2,
                    "邱思雨": 13,
                    "陈宇晟": 14,
                    "陈雅琴": 16,
                    "韩依霖": 5,
                    "马浩杰": 0,
                    "魏斓": 6
                },
                {
                    "余淑静": 18,
                    "冯子恒": 1,
                    "吴家豪": 1,
                    "周新文": 6,
                    "夏宇宸": 11,
                    "姜文浩": 4,
                    "孙妍菲": 14,
                    "宋寅明": 7,
                    "尚海伦": 7,
                    "崔正豪": 17,
                    "张全婵": 10,
                    "日期": 10,
                    "王丙文": 20,
                    "谷兆宇": 3,
                    "赵泽林": 8,
                    "邱思雨": 3,
                    "陈宇晟": 6,
                    "陈雅琴": 15,
                    "韩依霖": 6,
                    "马浩杰": 10,
                    "魏斓": 16
                }
            ]
        }
    },
    "k_datas": [
        {
            "data": {
                "columns": [
                    "日期",
                    "陈雅琴",
                    "赵海洲",
                    "陈真颖",
                    "夏宇宸",
                    "刘鹤尧",
                    "许亨哈",
                    "杨雅雯",
                    "吴家豪",
                    "韩依霖",
                    "尚海伦",
                    "陈鸿宇"
                ],
                "rows": [
                    {
                        "刘鹤尧": 20,
                        "吴家豪": 1,
                        "夏宇宸": 19,
                        "尚海伦": 17,
                        "日期": 1,
                        "杨雅雯": 15,
                        "许亨哈": 18,
                        "赵海洲": 12,
                        "陈真颖": 7,
                        "陈雅琴": 4,
                        "陈鸿宇": 20,
                        "韩依霖": 8
                    },
                    {
                        "刘鹤尧": 15,
                        "吴家豪": 20,
                        "夏宇宸": 11,
                        "尚海伦": 20,
                        "日期": 2,
                        "杨雅雯": 15,
                        "许亨哈": 16,
                        "赵海洲": 5,
                        "陈真颖": 19,
                        "陈雅琴": 7,
                        "陈鸿宇": 3,
                        "韩依霖": 12
                    },
                    {
                        "刘鹤尧": 8,
                        "吴家豪": 1,
                        "夏宇宸": 10,
                        "尚海伦": 13,
                        "日期": 3,
                        "杨雅雯": 13,
                        "许亨哈": 17,
                        "赵海洲": 4,
                        "陈真颖": 14,
                        "陈雅琴": 10,
                        "陈鸿宇": 12,
                        "韩依霖": 15
                    },
                    {
                        "刘鹤尧": 3,
                        "吴家豪": 17,
                        "夏宇宸": 0,
                        "尚海伦": 9,
                        "日期": 4,
                        "杨雅雯": 19,
                        "许亨哈": 6,
                        "赵海洲": 14,
                        "陈真颖": 17,
                        "陈雅琴": 3,
                        "陈鸿宇": 9,
                        "韩依霖": 8
                    },
                    {
                        "刘鹤尧": 12,
                        "吴家豪": 4,
                        "夏宇宸": 17,
                        "尚海伦": 11,
                        "日期": 5,
                        "杨雅雯": 11,
                        "许亨哈": 0,
                        "赵海洲": 7,
                        "陈真颖": 11,
                        "陈雅琴": 6,
                        "陈鸿宇": 14,
                        "韩依霖": 5
                    },
                    {
                        "刘鹤尧": 1,
                        "吴家豪": 3,
                        "夏宇宸": 2,
                        "尚海伦": 0,
                        "日期": 6,
                        "杨雅雯": 7,
                        "许亨哈": 9,
                        "赵海洲": 10,
                        "陈真颖": 15,
                        "陈雅琴": 4,
                        "陈鸿宇": 18,
                        "韩依霖": 18
                    },
                    {
                        "刘鹤尧": 12,
                        "吴家豪": 13,
                        "夏宇宸": 14,
                        "尚海伦": 16,
                        "日期": 7,
                        "杨雅雯": 20,
                        "许亨哈": 9,
                        "赵海洲": 16,
                        "陈真颖": 19,
                        "陈雅琴": 10,
                        "陈鸿宇": 17,
                        "韩依霖": 19
                    },
                    {
                        "刘鹤尧": 6,
                        "吴家豪": 4,
                        "夏宇宸": 15,
                        "尚海伦": 8,
                        "日期": 8,
                        "杨雅雯": 8,
                        "许亨哈": 11,
                        "赵海洲": 2,
                        "陈真颖": 6,
                        "陈雅琴": 20,
                        "陈鸿宇": 7,
                        "韩依霖": 1
                    },
                    {
                        "刘鹤尧": 0,
                        "吴家豪": 2,
                        "夏宇宸": 5,
                        "尚海伦": 16,
                        "日期": 9,
                        "杨雅雯": 14,
                        "许亨哈": 2,
                        "赵海洲": 9,
                        "陈真颖": 8,
                        "陈雅琴": 11,
                        "陈鸿宇": 5,
                        "韩依霖": 13
                    },
                    {
                        "刘鹤尧": 10,
                        "吴家豪": 18,
                        "夏宇宸": 6,
                        "尚海伦": 15,
                        "日期": 10,
                        "杨雅雯": 6,
                        "许亨哈": 8,
                        "赵海洲": 17,
                        "陈真颖": 6,
                        "陈雅琴": 10,
                        "陈鸿宇": 7,
                        "韩依霖": 4
                    }
                ]
            }
        },
        {
            "data": {
                "columns": [
                    "日期",
                    "马浩杰",
                    "殷一楠",
                    "张圣泽",
                    "周新文"
                ],
                "rows": [
                    {
                        "周新文": 20,
                        "张圣泽": 3,
                        "日期": 1,
                        "殷一楠": 17,
                        "马浩杰": 18
                    },
                    {
                        "周新文": 2,
                        "张圣泽": 2,
                        "日期": 2,
                        "殷一楠": 7,
                        "马浩杰": 18
                    },
                    {
                        "周新文": 2,
                        "张圣泽": 12,
                        "日期": 3,
                        "殷一楠": 3,
                        "马浩杰": 1
                    },
                    {
                        "周新文": 13,
                        "张圣泽": 8,
                        "日期": 4,
                        "殷一楠": 5,
                        "马浩杰": 19
                    },
                    {
                        "周新文": 4,
                        "张圣泽": 8,
                        "日期": 5,
                        "殷一楠": 7,
                        "马浩杰": 4
                    },
                    {
                        "周新文": 20,
                        "张圣泽": 5,
                        "日期": 6,
                        "殷一楠": 20,
                        "马浩杰": 13
                    },
                    {
                        "周新文": 0,
                        "张圣泽": 7,
                        "日期": 7,
                        "殷一楠": 1,
                        "马浩杰": 6
                    },
                    {
                        "周新文": 4,
                        "张圣泽": 8,
                        "日期": 8,
                        "殷一楠": 16,
                        "马浩杰": 19
                    },
                    {
                        "周新文": 14,
                        "张圣泽": 20,
                        "日期": 9,
                        "殷一楠": 13,
                        "马浩杰": 4
                    },
                    {
                        "周新文": 11,
                        "张圣泽": 3,
                        "日期": 10,
                        "殷一楠": 3,
                        "马浩杰": 1
                    }
                ]
            }
        },
        {
            "data": {
                "columns": [
                    "日期",
                    "刘鹤尧",
                    "张全婵",
                    "袁逸欣",
                    "陈雅琴",
                    "宋寅明"
                ],
                "rows": [
                    {
                        "刘鹤尧": 1,
                        "宋寅明": 11,
                        "张全婵": 4,
                        "日期": 1,
                        "袁逸欣": 2,
                        "陈雅琴": 0
                    },
                    {
                        "刘鹤尧": 8,
                        "宋寅明": 1,
                        "张全婵": 14,
                        "日期": 2,
                        "袁逸欣": 2,
                        "陈雅琴": 16
                    },
                    {
                        "刘鹤尧": 20,
                        "宋寅明": 7,
                        "张全婵": 18,
                        "日期": 3,
                        "袁逸欣": 9,
                        "陈雅琴": 18
                    },
                    {
                        "刘鹤尧": 19,
                        "宋寅明": 17,
                        "张全婵": 9,
                        "日期": 4,
                        "袁逸欣": 3,
                        "陈雅琴": 20
                    },
                    {
                        "刘鹤尧": 4,
                        "宋寅明": 17,
                        "张全婵": 19,
                        "日期": 5,
                        "袁逸欣": 19,
                        "陈雅琴": 16
                    },
                    {
                        "刘鹤尧": 8,
                        "宋寅明": 11,
                        "张全婵": 19,
                        "日期": 6,
                        "袁逸欣": 18,
                        "陈雅琴": 14
                    },
                    {
                        "刘鹤尧": 3,
                        "宋寅明": 10,
                        "张全婵": 1,
                        "日期": 7,
                        "袁逸欣": 1,
                        "陈雅琴": 8
                    },
                    {
                        "刘鹤尧": 0,
                        "宋寅明": 14,
                        "张全婵": 18,
                        "日期": 8,
                        "袁逸欣": 16,
                        "陈雅琴": 20
                    },
                    {
                        "刘鹤尧": 0,
                        "宋寅明": 6,
                        "张全婵": 20,
                        "日期": 9,
                        "袁逸欣": 9,
                        "陈雅琴": 5
                    },
                    {
                        "刘鹤尧": 1,
                        "宋寅明": 16,
                        "张全婵": 7,
                        "日期": 10,
                        "袁逸欣": 20,
                        "陈雅琴": 14
                    }
                ]
            }
        }
        ]
    }
    return jsonify(a)

@api.route("/chart/kmeans/", methods = ["GET"])
def getkmeans():
    # 20孩子，每个孩子10天数据
    raw_data = '[[1, 8, 20, 19, 4, 8, 3, 0, 0, 1], [18, 18, 1, 19, 4, 13, 6, 19, 4, 1], [4, 7, 10, 3, 6, 4, 10, 20, 11, 10], [12, 5, 4, 14, 7, 10, 16, 2, 9, 17], [7, 19, 14, 17, 11, 15, 19, 6, 8, 6], [17, 7, 3, 5, 7, 20, 1, 16, 13, 3], [19, 11, 10, 0, 17, 2, 14, 15, 5, 6], [4, 14, 18, 9, 19, 19, 1, 18, 20, 7], [20, 15, 8, 3, 12, 1, 12, 6, 0, 10], [18, 16, 17, 6, 0, 9, 9, 11, 2, 8], [2, 2, 9, 3, 19, 18, 1, 16, 9, 20], [15, 15, 13, 19, 11, 7, 20, 8, 14, 6], [1, 20, 1, 17, 4, 3, 13, 4, 2, 18], [0, 16, 18, 20, 16, 14, 8, 20, 5, 14], [11, 1, 7, 17, 17, 11, 10, 14, 6, 16], [8, 12, 15, 8, 5, 18, 19, 1, 13, 4], [17, 20, 13, 9, 11, 0, 16, 8, 16, 15], [3, 2, 12, 8, 8, 5, 7, 8, 20, 3], [20, 2, 2, 13, 4, 20, 0, 4, 14, 11], [20, 3, 12, 9, 14, 18, 17, 7, 5, 7]]'
    data = eval(raw_data)
    kmeans = Kmeans(data, 3)
    kmeans.get_k_rand()
    kmeans.compare_to_k()
    kmeans.get_k_avarage()
    cl = kmeans.compare_to_k2()
  
    while True:
        if len(cl[0]) < 4 or len(cl[1]) < 4 or len(cl[2]) < 4:
            kmeans = Kmeans(data, 3)
            kmeans.get_k_rand()
            kmeans.compare_to_k()
            kmeans.get_k_avarage()
            cl = kmeans.compare_to_k2()
        else:
            break;
    data1 = kmeans_helper(cl[0])
    data2 = kmeans_helper(cl[1])
    data3 = kmeans_helper(cl[2])
    data_all = kmeans_helper(cl[0] + cl[1] + cl[2])

    return jsonify({
            "data_all": data_all,
            "k_datas": [
                data1,
                data2,
                data3,
            ]
        })
